Model: "model_2"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_3 (InputLayer)        [(None, 5, 1)]            0         
                                                                 
 conv1d (Conv1D)             (None, 3, 128)            512       
                                                                 
 lstm_2 (LSTM)               (None, 256)               394240    
                                                                 
 dense_6 (Dense)             (None, 128)               32896     
                                                                 
 dense_7 (Dense)             (None, 64)                8256      
                                                                 
 dense_8 (Dense)             (None, 20)                1300      
                                                                 
=================================================================
Total params: 437,204
Trainable params: 437,204
Non-trainable params: 0
_________________________________________________________________
